import numpy as np
from .base import ImageFilter


class ToGray(ImageFilter): # Перевод в оттенки серого (ToGray)
    def apply_filter(self, image):
        # Разделяем каналы BGR тк OpenCV хранит каналы в обратном порядке
        b = image[:, :, 0].astype(np.float32) # берём нулевой канал, превращаем целые числа в дробные чтоб не терять точность
        g = image[:, :, 1].astype(np.float32)
        r = image[:, :, 2].astype(np.float32)

        # Формула яркости в цветовом пространстве YUV: Y — яркость, U и V — цветовая информация.
        gray = 0.299 * r + 0.587 * g + 0.114 * b # берём только яркость и используем её как серое изображение, а U и V отбрасываем.
        
        # clip — все значения < 0 становятся 0, > 255 — 255. astype превращает float в целые числа 0..255 (формат для картинок)
        # после умножений значения могут вылезать за диапазон. мы приводим их к допустимым.
        return np.clip(gray, 0, 255).astype(np.uint8) 

